tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "microsoft/git"
tap "minamijoyo/tfupdate"
# Shell extension to jump to frequently used directories
brew "autojump"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Rust toolchain installer
brew "rustup-init"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Update version constraints in your Terraform configurations
brew "minamijoyo/tfupdate/tfupdate"
# Enable Windows-like alt-tab
cask "alt-tab"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Desktop password and login vault
cask "bitwarden"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "adpyke.vscode-sql-formatter"
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "databricks.sqltools-databricks-driver"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tyriar.lorem-ipsum"
