tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "microsoft/git"
tap "minamijoyo/tfupdate"
# Shell extension to jump to frequently used directories
brew "autojump"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python version management
brew "pyenv"
# Rust toolchain installer
brew "rustup-init"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Update version constraints in your Terraform configurations
brew "minamijoyo/tfupdate/tfupdate"
# Enable Windows-like alt-tab
cask "alt-tab"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Desktop password and login vault
cask "bitwarden"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager-core"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Desktop client for WhatsApp
cask "whatsapp"
