tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "minamijoyo/tfupdate"
brew "autojump"
brew "bfg"
brew "csvkit"
brew "gnumeric"
brew "neovim"
brew "pyenv"
brew "tmux"
brew "tree"
brew "zsh"
brew "minamijoyo/tfupdate/tfupdate"
cask "alt-tab"
cask "font-meslo-lg-nerd-font"
cask "insomnia"
cask "keka"
cask "raycast"
cask "stats"
